"""

Задача №2

Дано текст у файлі. Виведіть всі слова,що зустрічаються в тексті,
по одному на кожен рядок. Слова повинні бути відсортовані
за спаданням їх кількості появи в тексті, а при однаковій частоті появи -
в лексикографічному порядку. Примітка. Після того, як ви створите словник
усіх слів, вам захочеться впорядкувати його по частоті слова. Бажаного можна
домогтися, якщо створити список, елементами якого будуть кортежі з
двох елементів: частота зустрічальності слова і саме слово. Наприклад,
[(2, 'hi'), (1, 'what'), (3, 'is')]. Тоді стандартне сортування буде
сортувати список кортежів, при цьому кортежі порівнюються по першому елементу,
а якщо ці елементи рівні - то по другому.

Виконала: Гриб Наталія, 31І група
"""

from collections import defaultdict

# Читаємо текст з файлу
with open('input.txt', 'r', encoding='utf-8') as file:
    text = file.read()

# Розбиваємо текст на слова
words = text.split()

# Рахуємо кількість згадок кожного слова в словнику
word_counts = defaultdict(int)
for word in words:
    word_counts[word] += 1

# Створюємо список кортежів (частота, слово) і сортуємо його
sorted_word_counts = sorted([(count, word) for word, count in word_counts.items()], reverse=True)

# Виводимо слова по одному на кожен рядок
for count, word in sorted_word_counts:
    print(word)
